In [1]:
import pandas as pd

### Series对象拼接

In [3]:
ser1 = pd.Series([10,20,30],index=list('abc'))
ser2 = pd.Series([1,2,3],index=list('ABC'))
#使用concat方法进行拼接
pd.concat([ser1,ser2])

a    10
b    20
c    30
A     1
B     2
C     3
dtype: int64

In [4]:
ser3 = pd.Series(['100','200','300'],index=['aa','bb','cc'])
pd.concat([ser1,ser2,ser3])

a      10
b      20
c      30
A       1
B       2
C       3
aa    100
bb    200
cc    300
dtype: object

### DataFrame对象拼接

In [10]:
def make_df(cols,index):
    data_dict ={c:[c+str(i) for i in index]for c in cols}
    return pd.DataFrame(data_dict,index=index)

df1 = make_df('AB',[1,2])
df1

    A   B
1  A1  B1
2  A2  B2

In [11]:
df2 = make_df('AB',[3,4])
df2

    A   B
3  A3  B3
4  A4  B4

In [12]:
pd.concat([df1,df2]) #默认找相同的列索引

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [13]:
#添加axis参数
pd.concat([df1,df2],axis=1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [14]:
pd.concat([df1,df2],axis='columns')

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [15]:
df3 = make_df('AB',[1,2])
df3

    A   B
1  A1  B1
2  A2  B2

In [16]:
df1

    A   B
1  A1  B1
2  A2  B2

In [17]:
pd.concat([df1,df3])

    A   B
1  A1  B1
2  A2  B2
1  A1  B1
2  A2  B2

In [18]:
#解决重复索引  1.添加ignore_index
pd.concat([df1,df3],ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A1  B1
3  A2  B2

In [19]:
#解决重复索引  2.添加keys
pd.concat([df1,df3],keys=list('xy'))

      A   B
x 1  A1  B1
  2  A2  B2
y 1  A1  B1
  2  A2  B2

In [20]:
#concat中join = inner
a = make_df('ABC',[1,2])
b = make_df('BCD',[3,4])
pd.concat([a,b])

e:\soft\python36\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  after removing the cwd from sys.path.

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [21]:
pd.concat([a,b],join = 'inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4